# Get data from MySQL to Python

In [1]:
import pandas as pd
#import seaborn as sns
#import plotly.express as px
import numpy as np
#import plotly.graph_objects as go
#import math
import pymysql
#pd.set_option('display.max_column', None)
import warnings
warnings.filterwarnings('ignore')

In [2]:
!pip install pymysql

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pymysql in c:\users\atifn\appdata\roaming\python\python39\site-packages (1.0.2)

In [3]:
dbcon = pymysql.connect(host="localhost",user= "root",password= "55w00dland55",database= "sales")

In [4]:
dbcon

In [5]:
df = pd.read_sql_query("""select * from transactions """, dbcon, parse_dates= True)
df

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.0,INR
1,Prod001,Cus002,Mark002,2018-05-08,3,-1.0,INR
2,Prod002,Cus003,Mark003,2018-04-06,1,875.0,INR
3,Prod002,Cus003,Mark003,2018-04-11,1,583.0,INR
4,Prod002,Cus004,Mark003,2018-06-18,6,7176.0,INR
...,...,...,...,...,...,...,...
150278,Prod339,Cus005,Mark004,2019-04-18,1,394.0,INR\r
150279,Prod339,Cus020,Mark004,2019-04-23,1,667.0,INR\r
150280,Prod339,Cus007,Mark004,2019-04-23,1,625.0,INR\r
150281,Prod339,Cus006,Mark004,2019-04-24,7,8625.0,INR\r
150282,Prod339,Cus032,Mark009,2019-04-24,3,3792.0,INR\r